name: "ensemble_spam_filter"
platform: "ensemble"
input[
  {
    name: "input"
    data_type: TYPE_STRING
    dims: [1]
  }
]
output [
  {
    name: "label"
    data_type: TYPE_STRING
    dims:[1]
  }
  {
    name: "score"
    data_type: TYPE_FLOAT
    dims:[1]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      input_map {
        key: "input"
        value: "input"
      }
      output_map {
        key: "input_ids"
        value: "input_ids"
      }
      output_map {
        key: "attention_mask"
        value: "attention_mask"
      }
    },
    {
      model_name: "model"
      input_map {
        key: "input_ids"
        value: "input_ids"
      }
      input_map {
        key: "attention_mask"
        value: "attention_mask"
      }
      output_map {
        key: "logits"
        value: "logits"
      }
    },
    {
      model_name: "postprocess"
      input_map {
        key: "logits"
        value: "logits"
      }
      output_map {
        key: "label"
        value: "label"
      }
      output_map {
        key: "score"
        value: "score"
      }
    }
  ]
}

