name: "preprocess"
backend: "python"
input[
  {
   name:"input",
   data_type: TYPE_STRING,
   dims:[1]
  }
]
output[
  {
   name:"input_ids",
   data_type: TYPE_INT32,
   dims:[1,-1]
  }
  {
   name:"attention_mask",
   data_type: TYPE_INT32,
   dims:[1,-1]
  }
]
